[
"What is it that makes a “Reformed Baptist” distinct from other kinds of Baptists and Reformed folks? Reformed Baptists grew out of the English Reformation, emerging from Independent paedobaptist churches in the 1640’s for some very specific theological reasons, and they held to a particular kind of theology. Here are some of the theological identity markers of Reformed Baptist churches.

A. The Regulative Principle of Worship. This distinctive is put first because it is one of the main reasons Calvinistic Baptists separated from the Independent paedobaptists. The Particular (or Reformed) Baptists come from Puritanism, which sought to reform the English church according to God’s Word, especially its worship. When that became impossible due to Laud’s authoritative opposition, the Puritans separated (or were removed) from the English church. Within the Independent wing of Puritan separation, some of them saw a need to apply the regulative principle of worship to infant baptism as well, considering this to be the consistent outworking of the common Puritan mindset. The earliest Baptists believed that the elements of public worship are limited to what Scripture commands. John 4:23 says, “True worshippers will worship the Father in spirit and truth” (see also Matt 15:9). The revealed “truth” of Scripture limits the worship of God to what is prescribed in Scripture. The Second London Baptist Confession 22.1 says:

The acceptable way of worshipping the true God, is instituted by himself, and so limited by his own revealed will, that he may not be worshipped according to the imagination and devices of men, nor the suggestions of Satan, under any visible representations, or any other way not prescribed in the Holy Scriptures.

Because the Bible does not command infant baptism, early Baptists believed that infant baptism is forbidden in public worship, and the baptism of believers alone is to be practiced in worship. This regulative principle of worship limits the elements of public worship to the Word preached and read, the ordinances of baptism and the Lord’s Supper, prayer, the singing of Psalms, hymns, and spiritual songs, and whatever else the Scripture commands.

Many Baptists today have completely abandoned the regulative principle of worship in favor of entertainment-oriented worship, consumerism, individual preferences, emotionalism, and pragmatism. Such Baptists have abandoned the very principle that led to their initial emergence from paedobaptism. One wonders whether a church can depart from a doctrine necessary to the emergence of Baptists in their English context and still rightly identify as a “Baptist” church.

B. Covenant Theology. While Reformed paedobaptist churches sometimes insist that they alone are the heirs of true covenant theology, historic Reformed Baptists claimed to abandon the practice of infant baptism precisely because of the Bible’s covenant theology.

Reformed Baptists agree with Reformed paedobaptists that God made a covenant of works with Adam, which he broke and so brought condemnation on the whole human race (Rom 5:18). They also say that God mercifully made a covenant of grace with His elect people in Christ (Rom 5:18), which is progressively revealed in the Old Testament and formally established in the new covenant at the death of Christ (Heb 9:15-16). The only way anyone was saved under the old covenant was by virtue of this covenant of grace in Christ, such that there is only one gospel, or one saving promise, running through the Scriptures.

Baptist covenant theologians, however, believe they are more consistent than their paedobaptist brothers with respect to covenant theology’s own hermeneutic of New Testament priority. According to the New Testament, the Old Testament promise to “you and your seed” was ultimately made to Christ, the true seed (Gal 3:16). Abraham’s physical children were a type of Christ, but Christ Himself is the reality. The physical descendants were included in the old covenant, not because they are all children of the promise, but because God was preserving the line of promise, until Christ, the true seed, came. Now that Christ has come, there is no longer any reason to preserve a physical line. Rather, only those who believe in Jesus are sons of Abraham, true Israelites, members of the new covenant, and the church of the Lord Jesus (Gal 3:7). In both the Old and New Testaments, the “new covenant” is revealed to be a covenant of believers only, who are forgiven of their sins, and have God’s law written on their hearts (Heb 8:10-12).

Baptists today who adhere to dispensationalism believe that the physical offspring of Abraham are the rightful recipients of the promises of God to Abraham’s seed. But they have departed from their historic Baptist roots and from the hermeneutical vision of the organic unity of the Bible cast by their forefathers. Baptist theologian James Leo Garrett correctly notes that dispensationalism is an “incursion” into Baptist theology, which only emerged in the last one hundred fifty years or so. See James Leo Garrett, Baptist Theology: A Four-Century Study (Macon, GA: Mercer, 2009), 560-570.

c. Calvinism. Because Reformed Baptists held to the covenant theology (federalism) of the 17th century, they were all Calvinists. The theological covenants of the old federal theology undergirded the early Baptist expressions of their Calvinistic soteriology. When Adam broke the covenant of works, God cursed all human beings with totally depraved natures (Isa 24:5-6), making them unable and unwilling to come to Christ for salvation.

But God didn’t leave the human race to die in sin; rather, in eternity past, God unconditionally chose a definite number of people for salvation and formed a covenant of redemption with Christ about their salvation (Isa 53; 54:10; Lk 22:29). At the appointed time, Christ came into the world and obeyed the covenant of redemption, fulfilling the terms of the covenant of works that Adam broke. In the covenant of redemption, Jesus kept God’s law perfectly, died on the cross, atoned for the sins of His chosen people, and rose from the dead, having effectually secured salvation for them (Heb 9:12).

God made the covenant of grace with His elect people (Gen 3:15; Heb 9:15-16) in which He applies all the blessings of life merited by Christ in the covenant of redemption. The Holy Spirit mercifully unites God’s chosen people to Christ in the covenant of grace, giving them blessings of life purchased by Christ’s life and death. God irresistibly draws them to Himself in their effectual calling (Jn 6:37), gives them a living heart (Ezek 36:26), a living faith and repentance (Eph 2:8-9; Acts 11:18), a living verdict of justification (Rom 3:28), and a living and abiding holiness (1 Cor 1:30), causing them to persevere to the end (1 Cor 1:8). All of these life-blessings are the merits of Jesus Christ, purchased in the covenant of redemption, applied in the covenant of grace.

The doctrine of the covenants is the theological soil in which Calvinism grew among early Baptists. Calvinistic Baptists today need to recover the rich federal theology of their forefathers so that the doctrines of grace they’ve rediscovered will be preserved for future generations.

4. The Law of God. Reformed Baptists believe the 10 commandments are the summary of God’s moral law (Exod 20; Matt 5; Rom 2:14-22). They believe that unless we rightly understand the law, we cannot understand the gospel. The gospel is the good news that Jesus Christ kept the law for our justification by living in perfect obedience to earn the law’s blessing of life and by dying a substitutionary death to pay the law’s penalty. But the gospel isn’t only a promise of justification. It’s also the good news that Christ promises graciously to give the Holy Spirit to His people to kill their lawlessness and to make them more and more lawful. Titus 2:14 says that Christ “gave himself for us to redeem us from all lawlessness and to purify for himself a people for his own possession, who are zealous for good works.”

The Second London Baptist Confession, 19.5 says:

The moral law does for ever bind all, as well justified persons as others, to the obedience thereof,(10) and that not only in regard of the matter contained in it, but also in respect of the authority of God the Creator, who gave it;(11) neither does Christ in the Gospel any way dissolve, but much strengthen this obligation.(12)

10. Rom 13:8-10; Jas 2:8,10-12
11. Jas 2:10,11
12. Matt 5:17-19; Rom 3:31

Therefore while justified believers are free from the law as a covenant of works to earn justification and eternal life (Rom 7:1-6), God gives them His law as a standard of conduct or rule of life in their sanctification (Rom 8:4, 7). God’s moral law, summarized in the 10 commandments (Rom 2:14-24; 13:8-10; Jas 2:8-11), including the Sabbath commandment (Mk 2:27; Heb 4:9-10), is an instrument of sanctification in the life of the believer. Believers rest in Christ for their total salvation. Christ takes their burdens of guilt and shame, and His people take upon themselves the yoke of His law, and they learn obedience from a humble and gentle Teacher. 1 John 5:3 says, “For this is the love of God, that we keep His commandments. And His commandments are not burdensome.”

Baptists who hold to new covenant theology, or progressive covenantalism, do not have the same view of the law as the dominant stream of their Baptist forebears.

5. Confessional. Most of the early Baptists, both in England and in America, held to the Second London Baptist Confession of 1677/1689. While certainly not all Calvinistic Baptists subscribed to this confession, it was the main influence among Baptists in England and America after its publication. This confession, based on the Westminster Confession (Presbyterian) and the Savoy Declaration (Independent), was originally edited and published in 1677, but formally adopted by Baptist churches in 1689 after English persecution lifted.

Historic Reformed Baptists were thoroughgoing confessionalists. They were not bare “biblicists.” Biblicists deny words and doctrines not explicitly stated in Scripture, and they deny that the church’s historic teaching about the Bible has any secondary authority in biblical interpretation. The early Baptists, however, did not believe that individual church members or individual pastors should interpret the Bible divorced from the historic teaching of the church (Heb 13:7). They believed that the Bible alone is sufficient for doctrine and practice, but they also believed the Bible must be explained and read in light of the church’s interpretive tradition (1 Tim 3:15), which uses words other than the Bible (Acts 2:31 is one refutation of biblicism, since it explains Psalm 16 in words not used in that Psalm). Reformed Baptists believed that their theology was anchored in the church’s rich theological heritage and that it was a natural development of the doctrine of the church in light of the central insights of the Reformation (sola Scriptura: no baptizing infants; sola fide: only converts are God’s people).

Under the guise of upholding Sola Scriptura, many Christians today seek to read the Bible independently and come to their own private conclusions about what it means without consulting the church’s authorized teachers or the orthodox confessions of faith. But that’s not what Sola Scriptura historically meant. Scripture teaches that the church is the “pillar and support of the truth” (1 Tim 3:15). The church as a whole is charged with interpreting the Bible, and God has authorized teachers in the church throughout history. Therefore, while every individual Christian is responsible to understand Scripture for himself, no Christian should study the Bible without any consideration of what the great teachers of the past have taught about the Bible.

The majority of historic Reformed Baptists held to the Second London Baptist Confession of 1689 because they believed it is a compendium of theology that best summarizes the teaching of Scripture in small compass.

]